<a href="https://colab.research.google.com/github/anish6701/DE_Assignments/blob/main/SQL_Assignment_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
%pip install ipython-sql

Requirement already satisfied: ipython-sql in /usr/local/lib/python3.10/dist-packages (0.5.0)
Requirement already satisfied: prettytable in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (3.11.0)
Requirement already satisfied: ipython in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (7.34.0)
Requirement already satisfied: sqlalchemy>=2.0 in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (2.0.35)
Requirement already satisfied: sqlparse in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (0.5.1)
Requirement already satisfied: six in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: typing-extensions>=4.6.0 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy>=2.0->ipython-sql) (4.12.2)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy>=2.0->ipython-sql) (3.1.1)
Requirement already satisfied: setuptools>=18.5 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (71.0.4)
Collecting jedi>=0.16 (from ipython->ipython-sql)
  Using cached jedi-0.19.1-py2.py3-none-any.whl.metadata (22 kB)
Requirement already satisfied: decorator in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (4.4.2)
Requirement already satisfied: pickleshare in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: traitlets>=4.2 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (5.7.1)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (3.0.47)
Requirement already satisfied: pygments in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (2.18.0)
Requirement already satisfied: backcall in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: matplotlib-inline in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.1.7)
Requirement already satisfied: pexpect>4.3 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (4.9.0)
Requirement already satisfied: wcwidth in /usr/local/lib/python3.10/dist-packages (from prettytable->ipython-sql) (0.2.13)
Requirement already satisfied: parso<0.9.0,>=0.8.3 in /usr/local/lib/python3.10/dist-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.4)
Requirement already satisfied: ptyprocess>=0.5 in /usr/local/lib/python3.10/dist-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)
Using cached jedi-0.19.1-py2.py3-none-any.whl (1.6 MB)
Installing collected packages: jedi
Successfully installed jedi-0.19.1

**Above installing the required library**

**Below Laoding sql package and using SQLite **

In [2]:
%load_ext sql
%sql sqlite://

In [6]:
%%sql
CREATE TABLE Customers (

    CustomerID INT PRIMARY KEY,
    FirstName NVARCHAR(50),
    LastName NVARCHAR(50),
    Email NVARCHAR(100),
    BirthDate DATE

);

 * sqlite://
Done.

[]

**The query is being executed to create a table with column names CustomerID, FirstName, LastName, Email, BirthDate.**

In [7]:
%%sql
select * from Customers;

 * sqlite://
Done.

[]


The code above executes to give the output of a empty table with column names given above **bold text**

In [8]:
%%sql
INSERT INTO Customers (CustomerID, FirstName, LastName, Email, BirthDate)

VALUES (1, 'John', 'Doe', 'johndoe22@example.com', '1990-01-01'),
(2, 'Johny', 'Dooe', 'jon23@example.com', '1890-01-01'),
(3, 'Janardan', 'vaid', 'joe90@example.com', '1994-05-10'),
(4, 'Jay', 'Rao', 'jay@example.com', '1999-09-16');

 * sqlite://
4 rows affected.

[]

In [9]:
%%sql
select * from Customers;

 * sqlite://
Done.

[(1, 'John', 'Doe', 'johndoe22@example.com', '1990-01-01'),
 (2, 'Johny', 'Dooe', 'jon23@example.com', '1890-01-01'),
 (3, 'Janardan', 'vaid', 'joe90@example.com', '1994-05-10'),
 (4, 'Jay', 'Rao', 'jay@example.com', '1999-09-16')]

In [10]:
%%sql

CREATE VIEW ActiveCustomers AS
SELECT CustomerID, FirstName, LastName
FROM Customers
WHERE BirthDate >= '1990-01-01';

 * sqlite://
Done.

[]

In [11]:
%%sql
select * from ActiveCustomers;

 * sqlite://
Done.

[(1, 'John', 'Doe'), (3, 'Janardan', 'vaid'), (4, 'Jay', 'Rao')]

The command executes to view the customers table with specific column names only in cell 10

This command shows the only values where BirthDate >= '1990-01-01' in cell 11

ASSIGNMENT FOR THE CUSTOMER TABLE

Alter the Customers Table

You realize that you need to track phone numbers for each customer. Modify the Customers table to include a new column called PhoneNumber (of type NVARCHAR(20)).

1.    Write a SQL query to add the PhoneNumber column to the Customers table.

In [12]:
%%sql

ALTER TABLE Customers
Add PhoneNumber NVARCHAR(20) ;

 * sqlite://
Done.

[]

In [13]:
%%sql
select * from Customers;

 * sqlite://
Done.

[(1, 'John', 'Doe', 'johndoe22@example.com', '1990-01-01', None),
 (2, 'Johny', 'Dooe', 'jon23@example.com', '1890-01-01', None),
 (3, 'Janardan', 'vaid', 'joe90@example.com', '1994-05-10', None),
 (4, 'Jay', 'Rao', 'jay@example.com', '1999-09-16', None)]

Problem 2: Update the PhoneNumber Column

Now that you have added the PhoneNumber column, update the phone numbers for some customers using the following format: '(123) 456-7890'.

**1.    Write a SQL query to update the phone number of customers with CustomerID 1 and 2**

In [14]:
%%sql
UPDATE customers
SET phonenumber = '1234567890'
WHERE customerid in(1,2);

 * sqlite://
2 rows affected.

[]

In [15]:
%%sql
select * from Customers;

 * sqlite://
Done.

[(1, 'John', 'Doe', 'johndoe22@example.com', '1990-01-01', '1234567890'),
 (2, 'Johny', 'Dooe', 'jon23@example.com', '1890-01-01', '1234567890'),
 (3, 'Janardan', 'vaid', 'joe90@example.com', '1994-05-10', None),
 (4, 'Jay', 'Rao', 'jay@example.com', '1999-09-16', None)]

Problem 3: Use CASE for Conditional Queries

Some customers have incomplete email addresses. You need to generate a list that flags these incomplete records.

1.    Write a SQL query that returns CustomerID, FirstName, LastName, and a new column EmailStatus. If the email contains @, the EmailStatus should show 'Valid', otherwise it should show 'Invalid'.



Before executing this command I am inserting few rows && CREATING A NEW COLUMN {EmailStatus} to check the constraint provided by Varun

In [16]:
%%sql

ALTER TABLE Customers
Add EmailStatus VARCHAR(20) ;

 * sqlite://
Done.

[]

In [17]:
%%sql
select * from Customers;

 * sqlite://
Done.

[(1, 'John', 'Doe', 'johndoe22@example.com', '1990-01-01', '1234567890', None),
 (2, 'Johny', 'Dooe', 'jon23@example.com', '1890-01-01', '1234567890', None),
 (3, 'Janardan', 'vaid', 'joe90@example.com', '1994-05-10', None, None),
 (4, 'Jay', 'Rao', 'jay@example.com', '1999-09-16', None, None)]

In [18]:
%%sql
INSERT INTO Customers (CustomerID, FirstName, LastName, Email, BirthDate)

VALUES (5, 'John', 'Lou', 'johndoe22_example.com', '1990-01-01'),

(6, 'Jim', 'Seth', 'example.com', '1998-01-11');

 * sqlite://
2 rows affected.

[]

In [19]:
%%sql

select * from Customers;

 * sqlite://
Done.

[(1, 'John', 'Doe', 'johndoe22@example.com', '1990-01-01', '1234567890', None),
 (2, 'Johny', 'Dooe', 'jon23@example.com', '1890-01-01', '1234567890', None),
 (3, 'Janardan', 'vaid', 'joe90@example.com', '1994-05-10', None, None),
 (4, 'Jay', 'Rao', 'jay@example.com', '1999-09-16', None, None),
 (5, 'John', 'Lou', 'johndoe22_example.com', '1990-01-01', None, None),
 (6, 'Jim', 'Seth', 'example.com', '1998-01-11', None, None)]

In [20]:
%%sql

select CustomerID,
    FirstName,
    LastName,
    CASE
        WHEN Email LIKE '%@%' THEN 'Valid'
        ELSE 'Invalid'
    END AS EmailStatus
FROM Customers;

 * sqlite://
Done.

[(1, 'John', 'Doe', 'Valid'),
 (2, 'Johny', 'Dooe', 'Valid'),
 (3, 'Janardan', 'vaid', 'Valid'),
 (4, 'Jay', 'Rao', 'Valid'),
 (5, 'John', 'Lou', 'Invalid'),
 (6, 'Jim', 'Seth', 'Invalid')]

Problem 4: Group By and Aggregate Data

You want to understand the distribution of customers by birth year.

    1.    Write a SQL query that groups customers by their birth year and counts the number of customers born in each year.

In [23]:
%%sql

select *,count(CustomerID) from customers
GROUP BY BirthDate
ORDER BY COUNT(CustomerID) DESC;

 * sqlite://
Done.

[(1, 'John', 'Doe', 'johndoe22@example.com', '1990-01-01', '1234567890', None, 2),
 (4, 'Jay', 'Rao', 'jay@example.com', '1999-09-16', None, None, 1),
 (6, 'Jim', 'Seth', 'example.com', '1998-01-11', None, None, 1),
 (3, 'Janardan', 'vaid', 'joe90@example.com', '1994-05-10', None, None, 1),
 (2, 'Johny', 'Dooe', 'jon23@example.com', '1890-01-01', '1234567890', None, 1)]

In [25]:
%%sql

select * from customers;

 * sqlite://
Done.

[(1, 'John', 'Doe', 'johndoe22@example.com', '1990-01-01', '1234567890', None),
 (2, 'Johny', 'Dooe', 'jon23@example.com', '1890-01-01', '1234567890', None),
 (3, 'Janardan', 'vaid', 'joe90@example.com', '1994-05-10', None, None),
 (4, 'Jay', 'Rao', 'jay@example.com', '1999-09-16', None, None),
 (5, 'John', 'Lou', 'johndoe22_example.com', '1990-01-01', None, None),
 (6, 'Jim', 'Seth', 'example.com', '1998-01-11', None, None)]

In [24]:
%%sql

select strftime('%Y', BirthDate) AS BirthYear, COUNT(*) AS CustomerCount
FROM Customers
GROUP BY BirthYear
ORDER BY BirthYear DESC;

 * sqlite://
Done.

[('1999', 1), ('1998', 1), ('1994', 1), ('1990', 2), ('1890', 1)]

**2.    Ensure that the result includes only customers born after 1980. **

In [27]:
%%sql

select strftime('%Y', BirthDate) AS BirthYear, COUNT(*) AS CustomerCount
FROM Customers
where BirthDate > '1980-12-31'
GROUP BY BirthYear
ORDER BY BirthYear DESC;

 * sqlite://
Done.

[('1999', 1), ('1998', 1), ('1994', 1), ('1990', 2)]

Problem 5: Use HAVING to Filter Aggregated Results

You are only interested in years where more than 1 customer was born.

    1.    Modify the query from Problem 4 to include only years where the number of customers is greater than 1.

In [29]:
%%sql

select strftime('%Y', BirthDate) AS BirthYear, COUNT(*) AS CustomerCount
FROM Customers
GROUP BY BirthYear
having Count(*)>1
ORDER BY BirthYear DESC;

 * sqlite://
Done.

[('1990', 2)]

Problem 6: Search with LIKE

You want to find all customers whose first or last name starts with 'A'.

    1.    Write a SQL query to return CustomerID, FirstName, and LastName for all customers where the FirstName or LastName begins with the letter 'A'.

In [32]:
%%sql

select CustomerID, FirstName, LastName
FROM Customers
WHERE FirstName LIKE '%a%' OR LastName LIKE '%a%';

 * sqlite://
Done.

[(3, 'Janardan', 'vaid'), (4, 'Jay', 'Rao')]

In [33]:
%%sql
INSERT INTO Customers (CustomerID, FirstName, LastName, Email, BirthDate)

VALUES (7, 'Anish', 'Upadhyay', 'au@example.com', '1990-01-01'),
(8, 'Andrew', 'alaine', 'al@example.com', '1890-01-01');


select * from Customers;

 * sqlite://
2 rows affected.
Done.

[(1, 'John', 'Doe', 'johndoe22@example.com', '1990-01-01', '1234567890', None),
 (2, 'Johny', 'Dooe', 'jon23@example.com', '1890-01-01', '1234567890', None),
 (3, 'Janardan', 'vaid', 'joe90@example.com', '1994-05-10', None, None),
 (4, 'Jay', 'Rao', 'jay@example.com', '1999-09-16', None, None),
 (5, 'John', 'Lou', 'johndoe22_example.com', '1990-01-01', None, None),
 (6, 'Jim', 'Seth', 'example.com', '1998-01-11', None, None),
 (7, 'Anish', 'Upadhyay', 'au@example.com', '1990-01-01', None, None),
 (8, 'Andrew', 'alaine', 'al@example.com', '1890-01-01', None, None)]

In [34]:
%%sql

select CustomerID, FirstName, LastName
FROM Customers
WHERE FirstName LIKE 'A%' OR LastName LIKE 'a%';

 * sqlite://
Done.

[(7, 'Anish', 'Upadhyay'), (8, 'Andrew', 'alaine')]